### `Importing Necessary Libraries`

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### `Data Import`

In [3]:
raw_data = pd.read_csv("https://github.com/neustackapp/assignment/raw/refs/heads/main/employee_data.csv")
print(f"Shape of the dataset: {raw_data.shape}")
raw_data.head()

Shape of the dataset: (10000, 10)

,employee_id,age,gender,marital_status,salary,employment_type,region,has_dependents,tenure_years,enrolled
0,10001,60,Female,Single,55122.97,Part-time,West,No,1.5,0
1,10002,50,Female,Single,89549.66,Full-time,West,Yes,12.8,1
2,10003,36,Male,Divorced,74145.66,Part-time,Midwest,No,3.8,0
3,10004,64,Female,Married,53877.83,Full-time,Northeast,No,3.3,0
4,10005,29,Male,Single,63404.63,Contract,Midwest,Yes,10.0,0

### `Statistical Summary`

In [ ]:
raw_data.describe() ## Statistical info. about numerical columns..

       employee_id         age         salary  tenure_years      enrolled
count  10000.00000  10000.0000   10000.000000  10000.000000  10000.000000
mean   15000.50000     43.0020   65032.967907      3.967720      0.617400
std     2886.89568     12.2858   14923.958446      3.895488      0.486046
min    10001.00000     22.0000    2207.790000      0.000000      0.000000
25%    12500.75000     33.0000   54714.342500      1.200000      0.000000
50%    15000.50000     43.0000   65056.050000      2.800000      1.000000
75%    17500.25000     54.0000   75053.687500      5.600000      1.000000
max    20000.00000     64.0000  120312.000000     36.000000      1.000000

### It is clear that `mean and median are close` to each other, which essentially signifies the `absence of potential outliers`. However, we'll be plotting it to see if this actually True.

In [ ]:
raw_data.describe(include="object") ## Statistical info. about Categorical columns..

       gender marital_status employment_type region has_dependents
count   10000          10000           10000  10000          10000
unique      3              4               3      4              2
top      Male        Married       Full-time   West            Yes
freq     4815           4589            7041   2582           5993